tarea1/app/controllers/documents_controller.rb

  def index
    @documents = Document.all
    if params[:search]
      @documents = Document.search(params[:search]).order("created_at DESC")
    else
      @documents = Document.all.order("created_at DESC")
    end
    @show_enrollments = Enrollment.all
---
SELECT "documents".* FROM "documents" WHERE (public  = 't') AND (title LIKE '%doc%') ORDER BY created_at DESC
SELECT "enrollments".* FROM "enrollments" WHERE (document_id = 1)

  def my_documents

    @authors = Author.where("person_id = ?", current_person.id)
    @documents = []
    @authors.each do |author|
      @documents.append (Document.find(author.document_id))
    end

    @show_enrollments = Enrollment.all
---
SELECT "authors".* FROM "authors" WHERE (person_id = 1)
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE (document_id = 1)

  def show
    @show_enrollments = Enrollment.where("document_id = ?", params[:id])
---
SELECT "enrollments".* FROM "enrollments" WHERE (document_id = '1')

  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
        Enrollment.create(:category_id => @document.categories_id, :document_id => @document.id)
        Author.create(:document_id => @document.id, :person_id => current_person.id)
---
INSERT INTO "documents" ("title", "text", "categories_id", "created_at", "updated_at", "public") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "enrollments" ("category_id", "document_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["document_id", 1], ["created_at", "2017-05-31 09:36:43.765276"], ["updated_at", "2017-05-31 09:36:43.765276"]]
INSERT INTO "authors" ("person_id", "document_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["person_id", 1], ["document_id", 1], ["created_at", "2017-05-31 09:36:43.907369"], ["updated_at", "2017-05-31 09:36:43.907369"]]

  def update
    respond_to do |format|
      if @document.update(document_params)
---
UPDATE "documents" SET "text" = ?, "categories_id" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["text", "blaaa bla blaa\r\n\r\n# blaaa blabla"], ["categories_id", 1], ["updated_at", "2017-06-02 13:08:32.333559"], ["id", 2]]

    def set_document
      @document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]