tarea1/app/views/enrollments/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %>
    <%= f.select :category_id, options_for_select(Category.all.map{|s|[s.to_s, s.id]}) %>

SELECT "documents".* FROM "documents"
---
    <%= f.label :document_id %>
    <%= f.select :document_id, options_for_select(Document.all.map{|s|[s.to_s, s.id]}) %>