tarea1/app/views/documents/_form.html.erb


<% if Category.exists? %>
---
SELECT  1 AS one FROM "categories" LIMIT ?  [["LIMIT", 1]]
SELECT "categories".* FROM "categories"