app/controllers/enrollments_controller.rb

  def index
    @enrollments = Enrollment.all
---
SELECT "enrollments".* FROM "enrollments"

  def create
    @enrollment = Enrollment.new(enrollment_params)

    respond_to do |format|
      if @enrollment.save
---
INSERT INTO "enrollments" ("category_id", "document_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 2], ["document_id", 1], ["created_at", "2017-06-02 13:29:30.746118"], ["updated_at", "2017-06-02 13:29:30.746118"]]

    def set_enrollment
      @enrollment = Enrollment.find(params[:id])
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]